In [1]:
import numpy as np
import pandas as pd

In [12]:
atl = pd.read_excel('ATL.xlsx', index_col='')
# atl.set_index('SR_NO', inplace=True)
# # atl.reset_index(inplace=True)
# atl.columns = atl.columns.str.lower()

In [13]:
atl.count()

NTN              100000
NAME              99800
BUSINESS_NAME     31540
dtype: int64

In [35]:
atl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   sr_no          100000 non-null  int64
 1   ntn            100000 non-null  object
 2   name           99800 non-null   object
 3   business_name  31540 non-null   object
dtypes: int64(1), object(3)
memory usage: 3.1+ MB

In [44]:
# df_cnic = atl[atl['ntn'].apply(len) != 9]

In [46]:
df_ntn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12901 entries, 0 to 99199
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sr_no          12901 non-null  int64
 1   ntn            12901 non-null  object
 2   name           12901 non-null  object
 3   business_name  13 non-null     object
dtypes: int64(1), object(3)
memory usage: 503.9+ KB

In [47]:
df_cnic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 87099 entries, 24 to 99999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sr_no          87099 non-null  int64
 1   ntn            87099 non-null  object
 2   name           86899 non-null  object
 3   business_name  31527 non-null  object
dtypes: int64(1), object(3)
memory usage: 3.3+ MB

In [49]:
df_ntn

,sr_no,ntn,name,business_name
0,1,0000091-4,ARBOR ACRES PAKISTAN PRIVATE LIMITED,NaN
1,2,0000092-2,THE BANK OF KHYBER,NaN
2,3,0000094-9,AL KHAIR GADOON LIMITED,NaN
3,4,0000098-1,ACE WEAVERS PRIVATE LIMITED,NaN
4,5,0000128-7,ABASIN FLOUR GENERAL MILLS PRIVATE LIMITED,NaN
...,...,...,...,...
98292,98293,1562237-1,HASSAN HASSAN FOOD PRODUCTS PVT LIMITED,NaN
98293,98294,1562240-1,MUSLIM TRADING AGENCIES,NaN
98294,98295,1562250-9,STEEL CASTING AND ENGINEERING WORKS SCEW,NaN
99198,99199,1598632-2,CROWN MOVERS WORLDWIDE,NaN
99199,99200,1600723-9,KARACHI CLUB,NaN

In [59]:
df_cnic[df_cnic.ntn.apply(len) != 13]

,sr_no,ntn,name,business_name
394,395,0226134 / 0405860537541,HAMID GOHIR,SCHOEN CARPETS
554,555,0286111000051 / 6110199886265,SAMEER RANDHAWA,NaN
791,792,0354812 / 5783135056811,CHAUDHARY LIAQAT ALI,NaN
5705,5706,0912037 / 2083741006321,SIBGHAT RIAZ,NaN
5716,5717,0912430 / DG72426110952,FAZAL RAHIM,FAZAL KARIM TRADERS
59927,59928,1340290 / 3520224261316,NOUSHAHBA MUSSADAR,NaN

In [53]:
bank_ntn = np.array(df_ntn.ntn)
bank_cnic = np.array(df_cnic.ntn)

In [ ]:
np.in1d(bank_ntn, bank_cnic)

In [54]:
bank_cnic

array(['0000208778491', '0226134 / 0405860537541',
       '0286111000051 / 6110199886265', ..., '1610109030727',
       '1610109031268', '1610109037545'], dtype=object)